Tekla Open API Reference for Tekla Structures 2025
DrawingObject.NoAttributes.LoadAttributes Method
 It is not possible to load attributes for objects of this type because the objects have no attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool LoadAttributes(
	string AttributeFile
)
Public Overrides Function LoadAttributes (
	AttributeFile As String
) As Boolean
Parameters
AttributeFile
Type: System.String
The filename of the attribute file.
Return Value
Type: Boolean
False because it is not possible to load attributes.
See Also
Reference
DrawingObject.NoAttributes Class
Tekla.Structures.Drawing Namespace